branches/FFF/Documentation/NotesForCoders.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Notes for Coders</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="March 2010"/>
<meta name="author" content="Peter"/>
<meta name="description" content="Zambia is a piece of Conference Management Software.  This document is a general guide assisting in the way of programming the Zambia FFF-branch, as inhereted from the main branch."/>
<meta name="keywords" content="Zambia, Documentation, FFF branch"/>
<link rel="stylesheet" href="../webpages/Common.css" type="text/css"/>

</head>
<body>
<div id="content">

<h1 class="title">Notes for Coders</h1>

<p>Zambia is a piece of Conference Management Software.  This document is a general guide assisting in the way of programming the Zambia FFF-branch, as inhereted from the main branch.<br/>
<h2>Abstract:<br></h2><p>Zambia is a piece of Conference Management Software.  This document is a general guide assisting in the way of programming the Zambia FFF-branch, as inhereted from the main branch.</p>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Files </a>
<ul>
<li><a href="#sec-1_1">1.1 contains configuration information that each conference should set: Local/db_name.php </a></li>
<li><a href="#sec-1_2">1.2 contains css information: Common.css  ParticipantSection.css  StaffSection.css </a></li>
<li><a href="#sec-1_3">1.3 auto generated files that display a page (aka you can link to them) </a></li>
<li><a href="#sec-1_4">1.4 contains functions and constants that other pages use (not autogenerated) </a></li>
<li><a href="#sec-1_5">1.5 file that displays a page and can be linked to  (not autogenerated) </a></li>
<li><a href="#sec-1_6">1.6 file that processes a post operation, but calls a separate file to </a></li>
<li><a href="#sec-1_7">1.7 file that processes a post operation and display the results </a></li>
<li><a href="#sec-1_8">1.8 file that contains functions used by a page of the same name </a></li>
<li><a href="#sec-1_9">1.9 shell script for report generation: gencsv.sh genindex.sh genreports.sh </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Files </h2>
<div class="outline-text-2" id="text-1">

<p>We need consistency, so here is the plan:<br/>
</p>
</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> contains configuration information that each conference should set: Local/db_name.php </h3>
<div class="outline-text-3" id="text-1_1">


<p><br/>
</p></div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> contains css information: Common.css  ParticipantSection.css  StaffSection.css </h3>
<div class="outline-text-3" id="text-1_2">


<p><br/>
</p></div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> auto generated files that display a page (aka you can link to them) </h3>
<div class="outline-text-3" id="text-1_3">

<p>lowercasewithnounderscores.php<br/>
<b>No Longer Used!</b><br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3">1.4</span> contains functions and constants that other pages use (not autogenerated) </h3>
<div class="outline-text-3" id="text-1_4">

<p>lower_with_underscore_functions.php<br/>
db_functions.php           # for database related functions<br/>
data_functions.php<br/>
validate_functions.php<br/>
render_functions.php<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-1_5" class="outline-3">
<h3 id="sec-1_5"><span class="section-number-3">1.5</span> file that displays a page and can be linked to  (not autogenerated) </h3>
<div class="outline-text-3" id="text-1_5">

<p>StrongCaps.php<br/>
BrainstormStrongCaps.php    # for brainstorm pages<br/>
StaffStrongCaps.php    # for staff only pages<br/>
ParticipantStrongCaps.php    # for Participant only pages<br/>
CommonStrongCaps.php    # pages used by at least 2 different groups<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-1_6" class="outline-3">
<h3 id="sec-1_6"><span class="section-number-3">1.6</span> file that processes a post operation, but calls a separate file to </h3>
<div class="outline-text-3" id="text-1_6">

<p>display the results (deprecated?)<br/>
SubmitStongCaps.php<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-1_7" class="outline-3">
<h3 id="sec-1_7"><span class="section-number-3">1.7</span> file that processes a post operation and display the results </h3>
<div class="outline-text-3" id="text-1_7">

<p>(often by calling a function that is elsewhere)<br/>
StrongCaps_POST.php<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-1_8" class="outline-3">
<h3 id="sec-1_8"><span class="section-number-3">1.8</span> file that contains functions used by a page of the same name </h3>
<div class="outline-text-3" id="text-1_8">

<p>(and not elsewhere.   If it is used elsewhere it needs to move)<br/>
StrongCaps_FNC.php<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-1_9" class="outline-3">
<h3 id="sec-1_9"><span class="section-number-3">1.9</span> shell script for report generation: gencsv.sh genindex.sh genreports.sh </h3>
<div class="outline-text-3" id="text-1_9">


<p><br/>
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Peter
<a href="mailto:NELA.Percy@gmail.com">&lt;NELA.Percy@gmail.com&gt;</a>
</p>
</div>
</div>
</body>
</html>
