branches/FFF/Documentation/PDF/NotesForCoders.tex
\documentclass[tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Notes for Coders}
\author{Peter}
\date{March 2010}

\begin{document}

\maketitle

% Org-mode is exporting headings to 3 levels.

\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{1pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{{Peter} <{NELA.Percy@gmail.com}>}
\cfoot{}
\rfoot{\thepage}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Conference Management Software.  This document is a general guide assisting in the way of programming the Zambia FFF-branch, as inhereted from the main branch.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\chead{{Notes for Coders}}
\tableofcontents
\listoftables
\listoffigures
\newpage
\pagenumbering{arabic}
\section{Files}
\label{sec-1}

We need consistency, so here is the plan:
\subsection{contains configuration information that each conference should set: Local/db\_{}name.php}
\label{sec-1_1}
\subsection{contains css information: Common.css  ParticipantSection.css  StaffSection.css}
\label{sec-1_2}
\subsection{auto generated files that display a page (aka you can link to them)}
\label{sec-1_3}

   lowercasewithnounderscores.php
   \textbf{No Longer Used!}
\subsection{contains functions and constants that other pages use (not autogenerated)}
\label{sec-1_4}

   lower\_{}with\_{}underscore\_{}functions.php
   db\_{}functions.php           \# for database related functions
   data\_{}functions.php
   validate\_{}functions.php
   render\_{}functions.php
\subsection{file that displays a page and can be linked to  (not autogenerated)}
\label{sec-1_5}

   StrongCaps.php
   BrainstormStrongCaps.php    \# for brainstorm pages
   StaffStrongCaps.php    \# for staff only pages
   ParticipantStrongCaps.php    \# for Participant only pages
   CommonStrongCaps.php    \# pages used by at least 2 different groups
\subsection{file that processes a post operation, but calls a separate file to}
\label{sec-1_6}

   display the results (deprecated?)
   SubmitStongCaps.php
\subsection{file that processes a post operation and display the results}
\label{sec-1_7}

   (often by calling a function that is elsewhere)
   StrongCaps\_{}POST.php
\subsection{file that contains functions used by a page of the same name}
\label{sec-1_8}

   (and not elsewhere.   If it is used elsewhere it needs to move)
   StrongCaps\_{}FNC.php
\subsection{shell script for report generation: gencsv.sh genindex.sh genreports.sh}
\label{sec-1_9}

\end{document}
